#                                               условные конструкции




# name = input("Как зовут? ")
# time = input("Какое время: ")

# if time == "утро":
#     print(f"Доброе утро, {name}")
# elif time =="день":
#     print((f"Добрый день {name}"))
# elif time == "вечер":
#     print(f"добрый вечер {name}")

#-------------------светофор------------------------------------------------------------------

# signal = input("введите свет")

# if signal == "зеленый":
#     print("Езжай")
# elif signal == "желтый":
#     print("готовся")
# elif signal == "красный":
#     print("стоп")
# else:
#     print("Смотрим по ситуации!")


#--------------------------------------------------------------------------------------------------


#////////////////////////////////////////////////////////////////////////////////////////////////////////////////
#                           циклы

# c = 0
# while c != 5:
#     c += 1
#     print(c)
# if c == 5:
#     break

#============================================
# j = 5
    
# while j != 0:
#     print(j)
#     j -= 1
#         continue
#     print(j)



#------------------------------------------------------------
# right_word = "python"
# input_word = "pytrhon"

# for i in input_word:
#     if i not in right_word:
#         print(f"этой буквы нет - {i}")
